{"meta":{"title":"Fit 4 Revolution","subtitle":"Die no bullshit Fitnessressource","description":"","author":"Fit4Revo","url":"https://fit4revolution.github.io","root":"/"},"pages":[{"title":"Über Fit4Revolution","date":"2020-10-22T20:40:45.000Z","updated":"2020-10-22T20:41:38.136Z","comments":true,"path":"about/index.html","permalink":"https://fit4revolution.github.io/about/index.html","excerpt":"","text":"hier findet ihr…"},{"title":"Fragen und Kritik?","date":"2020-10-22T20:42:00.000Z","updated":"2020-10-22T20:56:55.697Z","comments":true,"path":"Kontakt/index.html","permalink":"https://fit4revolution.github.io/Kontakt/index.html","excerpt":"","text":"Hinterlasst gerne ein Kommi unter dem jeweiligen Artikel, ich werde versuchen darauf einzugehen. Falls euch ein direkter, nicht-öffentlicher Draht lieber ist, könnt ihr auch gerne eine Mail an (XX) schreiben. Key auf Anfrage. Werft gerne auch einen Blick in die Häufig gestellten Fragen (FAQ) und schaut ob eure Frage dort vielleicht schon beantwortet wurde."}],"posts":[{"title":"Überblick über effektives Krafttraining und Muskelaufbau","slug":"Uberblick-uber-effektives-Krafttraining-und-Muskelaufbau","date":"2020-10-22T13:50:39.000Z","updated":"2020-10-23T08:00:39.000Z","comments":true,"path":"/ueberblick-muskelaufbau-krafttraining.html","link":"","permalink":"https://fit4revolution.github.io/ueberblick-muskelaufbau-krafttraining.html","excerpt":"","text":"Dieser Artikel beschreibt die Zusammenhänge der wichtigsten Themen, die ihr für ein effizientes Training für den Muskelaufbau im Blick haben solltet. Die einzelnen Themen werden in weiteren Artikeln vertieft. Die Komponenten für erfolgreiches Krafttraining Die Komponenten, die ihr für ein erfolgreiches Training benötigt, lassen sich in einem 3-Säulen-Modell abbilden. Ganz oben stehen die Ziele, die ihr erreichen wollt. Um diese Ziele zu erreichen, ist es wichtig die 3 Säulen des Krafttrainings zu bedienen(XX?): Regelmäßiges Training, passende Ernährung und ausreichend Ruhe und Schlaf. Alle drei Säulen sind dabei gleichermaßen wichtig, sonst wackelt die ganze Konstruktion. Schließlich steht alles auf dem Fundament der Routinen. Die helfen euch die Komponenten in die Praxis umzusetzen und damit letztlich eure Ziele zu erreichen. Die einzelnen Bausteine für euer Training werden im folgenden noch etwas weiter ausgeführt. Die ZieleWas ihr mit regelmäßigem Training erreichen wollt, müsst ihr mit euch selbst ausmachen. Ziele können sein: Fit werden Körpergewicht ändern Muskeln aufbauen Stärker werden Damit die Ziele Wirkung entfalten können, sollten diese möglichst konkret formuliert werden. Wie das geht, erklärt der Artikel Ziele festlegen genauer. Die 3 SäulenDas Herzstück bilden drei Komponenten, die jeweils gleich wichtig sind: Training, Ernährung, Schlaf. Wenn das Training Ergebnisse zeigen soll, müssen der Zusammenhang beachtet werden. So wachsen Muskeln in der Ruhephase, besonders im Schlaf. Genauso essentiell ist die richtige Ernährung, um dem Körper die nötigen Ressourcen zur Verfügung zu stellen, mit denen er Muskeln aufbauen kann. Das Training alleine bringt es nicht. Gleichzeitig bringen passende Ernährung und ausreichend Schlaf nichts, wenn das Training nicht passt. [XX: noch ein Satz] TrainingWer fit werden oder Muskeln aufbauen will, muss regelmäßig trainieren, daran führt kein Weg vorbei. Aber kann und sollte Spaß machen, dabei hilft euch eine gute Playlist oder andere Mittel zur Motivation [XX Mindset]. Für den Muskelaufbau sind vor allem die Frequenz und Intensität des Trainings entscheidend. Um den Muskel zum Wachstum zu bewegen, müsst ihr ihm den richtigen Reiz durch intensives Training versetzen. Der Reiz muss dabei oft genug wiederholt werden, gleichzeitig mit genug Erholungszeit dazwischen, um Verletzungen zu vermeiden und Zeit für das eigentliche Wachstum zu geben, was nämlich nicht während des Trainings erfolgt, sondern in der Zeit dazwischen. Wie ihr zu einem passenden Trainingsplan kommt, erfahrt ihr in dem Artikel xx Ausruhen und SchlafDie Ruhephase kommt bei der Gesamtbetrachtung oft zu kurz. Ausreichend Erholung zu finden, ist in der kapitalistischen Alltagsmühle oft nicht leicht. Diese Zeiten dann noch bewusst in den Wochenalltag einzuplanen wird schnell zur Herausforderung. Aber dem Thema sollte trotzdem die nötige Aufmerksamkeit gewidmet werden Warum ist Schlaf so wichtigErnährungDas Thema Ernährung ist oft heikel. In Buchhandlungen lassen sich ganze Regalreihen mit Diätratgebern finden, das Internet bietet Unmengen an Ernährungstipps und aus dem persönlichen Umfeld werden oft auch noch Ansprüche an das eigene Essverhalten gestellt. Problem ist, dass diese Tipps und Ratgeber sich nicht nur oft widersprechen, sondern mitunter auch schädlich sind, spätestens auf lange Sicht. Bekannte Phänomene, wie der Jojo-Effekt, zeugen von mangelnder Nachhaltigkeit. Der Schlüssel um diese Probleme zu vermeiden, ist die Analyse, welche Nährstoffe der Körper benötigt, damit wir unsere Ziele erreichen. Bei Bedarf sollte dann eine nachhaltige Ernährungsumstellung erfolgen, die keine stärkere Mangelernährung zur Folge hat. Eine vegane Ernährungsweise stellt dabei kein Hindernis dar, auch dann nicht, wenn ihr starken Muskelaufbau (Bodybuilding) als Ziel habt. Knapp auf den Punkt gebracht, sieht die für den Kraftsport empfohlene Ernährung einen hohen Proteinanteil und nur einen kleinen Teil Kohlenhydrate, dazu viel Gemüse. Einzelheiten findet ihr im [Detailartikel zu Ernährung]. Das FundamentDie Grundlage für das ganze Konzept bilden Routinen. Das sind fest in unseren Alltag eingebaute Handlungen, die ein nachhaltiges Wirken sicherstellen sollen. Mit diesen Routinen steht und fällt das gesamte Konzept. Unter das Konzept fallen eigenständige Elemente, die in den Alltag integriert werden können, wie Abend- und Morgenroutinen. Es können bestimmte Feedbacksysteme sein. Schließlich werden sich viele Elemente (XX?) der Routine in anderen Beschreibungen wiederfinden. So findet sich der Hinweis auf permanente Kontrolle der Trainingstechnik, um es zur Selbstverständlichkeit. Oder das Thema Ernährung fußt auf der Idee .ö.. Selbstverständlichkeit.","categories":[{"name":"Grundlagen","slug":"Grundlagen","permalink":"https://fit4revolution.github.io/categories/Grundlagen/"}],"tags":[{"name":"basics","slug":"basics","permalink":"https://fit4revolution.github.io/tags/basics/"},{"name":"training","slug":"training","permalink":"https://fit4revolution.github.io/tags/training/"},{"name":"schlaf","slug":"schlaf","permalink":"https://fit4revolution.github.io/tags/schlaf/"},{"name":"ernährung","slug":"ernahrung","permalink":"https://fit4revolution.github.io/tags/ernahrung/"},{"name":"ziele","slug":"ziele","permalink":"https://fit4revolution.github.io/tags/ziele/"}]}],"categories":[{"name":"Grundlagen","slug":"Grundlagen","permalink":"https://fit4revolution.github.io/categories/Grundlagen/"}],"tags":[{"name":"basics","slug":"basics","permalink":"https://fit4revolution.github.io/tags/basics/"},{"name":"training","slug":"training","permalink":"https://fit4revolution.github.io/tags/training/"},{"name":"schlaf","slug":"schlaf","permalink":"https://fit4revolution.github.io/tags/schlaf/"},{"name":"ernährung","slug":"ernahrung","permalink":"https://fit4revolution.github.io/tags/ernahrung/"},{"name":"ziele","slug":"ziele","permalink":"https://fit4revolution.github.io/tags/ziele/"}]}